ОперативныеЗадачиКР/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <posting>Deny</posting>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Компьютер</name>
    <type>
      <types>CatalogRef.Компьютеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СпецификацияКомпьютера</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>CatalogRef.СвойстваКомпьютеров</types>
      </type>
    </attributes>
    <attributes>
      <name>Комплектующая</name>
      <type>
        <types>CatalogRef.Комплектующие</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ОперативныеЗадачиКР/src/InformationRegisters/СпецификацииКомпьютеров/СпецификацииКомпьютеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпецификацииКомпьютеров</name>
  <resources>
    <name>Комплектующая</name>
    <type>
      <types>CatalogRef.Комплектующие</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Компьютер</name>
    <type>
      <types>CatalogRef.Компьютеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СвойствоКомпьютера</name>
    <type>
      <types>CatalogRef.СвойстваКомпьютеров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОперативныеЗадачиКР/src/Documents/ЗаказПокупателя/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура КомпьютерПриИзменении(Элемент)
	
	ПолучитьТиповуюСпецификациюКомпьютера();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьТиповуюСпецификациюКомпьютера()
	
	УстановитьДоступностьСпецификацииКомпьютера();
	
	Если Объект.Компьютер = Справочники.Компьютеры.ОсобаяКонфигурация Тогда 
		Объект.СпецификацияКомпьютера.Очистить();
		Возврат;
	КонецЕсли;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпецификацииКомпьютеров.СвойствоКомпьютера КАК Свойство,
		|	СпецификацииКомпьютеров.Комплектующая,
		|	СпецификацииКомпьютеров.Количество
		|ИЗ
		|	РегистрСведений.СпецификацииКомпьютеров КАК СпецификацииКомпьютеров
		|ГДЕ
		|	СпецификацииКомпьютеров.Компьютер = &Компьютер";

	Запрос.УстановитьПараметр("Компьютер", объект.Компьютер);

	Результат = Запрос.Выполнить();

	Объект.СпецификацияКомпьютера.Загрузить(Результат.Выгрузить());
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступностьСпецификацииКомпьютера()
	
	Если Объект.Компьютер = Справочники.Компьютеры.ОсобаяКонфигурация Тогда 
		
		Элементы.СпецификацияКомпьютера.Доступность = Истина;
		
	Иначе
		
		Элементы.СпецификацияКомпьютера.Доступность = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьДоступностьСпецификацииКомпьютера();
	
КонецПроцедуры
